// # hpguppi_atasnap.h - Definitions for ATA SNAP F Engine packets
//
// ## The ATA SNAP F Engine
//
// The ATA SNAP F Engine digitizes two outputs of the IF output from the ATA
// RFCBs (Radio Frequency Converter Boards) at 1800 MHz for a Nyquist bandwidth
// of 900 MHz.  The IF output of the RFCBs occupies ~600 MHz between 0 and 900
// MHz in the first Nyquist zone, so no spectral flips happen due to the
// digitization.  The two outputs typically come from two polarizations of the
// same antenna, but the gateware imposes no such hard constraints on the
// signal routing.
//
// These data are then channelized into 4096 frequency channels that are
// 900/4096 MHz (~220 kHz) wide.  The F engine can run in either "spectromweter
// mode" or "voltage mode".  In either mode, the output data is packetized and
// transmitted over a 10 GbE network interface to a user specified destination
// IP address (or addresses), which can be unitcast or multicast.  Currently,
// only voltage mode is supported by the hpguppi_atasnap_thread.
//
// In voltage mode, the complex outputs of the polyphase filter bank (PFB)
// channelizer are scaled and requantized to 4 bits for each real/imaginary
// component of the complex voltage.  With 900 MHz of bandwidth, a 4096 channel
// spectrum is produced every 4096/900e6 seconds (~4.55 usec).  At 8 bits per
// sample, the total data rate for both polarizations is 900e6*8*2 = 14.4 Gbps.

// from received packets.  Whenever the first PKTIDX of a block is received
// (i.e. whenever PKTIDX is a multiple of pktidx_per_block), the value
// for PKTSTART and DWELL are read from the status buffer.  PKTSTART is rounded
// down, if needed, to ensure that it is a multiple of pktidx_per_block,
// then PKTSTART is written back to the status buffer.  DWELL is interpreted as
// the number of seconds to record and is used to calculate PKTSTOP (which gets
// rounded down, if needed, to be a multiple of pktidx_per_block).
//
// The IDLE state is entered when there is no DESTIP defined in the status
// buffer or it is 0.0.0.0.  In the IDLE state, the DESTIP value in the status
// buffer is checked once per second.  If it is found to be something other
// than 0.0.0.0, the state transitions to the LISTEN state and the current
// blocks are reinitialized.
//
// To be operationally compatible with other hpguppi net threads, a "command
// FIFO" is created and read from in all states, but commands sent there are
// ignored.  State transitions are controlled entirely by DESTIP and
// PKTSTART/DWELL status buffer fields.
//
// In the LISTEN state, incoming packets are processed (i.e. stored in the net
// thread's output buffer) and full blocks are passed to the next thread.  When
// the processed PKTIDX is equal to PKTSTART the state transitions to RECORD
// and the following actions occur:
//
//   1. The MJD of the observation start time is calculated from PKTIDX,
//      SYNCTIME, and other parameters.
//
//   2. The packet stats counters are reset
//
//   3. The STT_IMDJ and STT_SMJD are updated in the status buffer
//
//   4. STTVALID is set to 1
//
// In the RECORD state, incoming packets are processed (i.e. stored in the net
// thread's output buffer) and full blocks are passed to the next thread (same
// as in the LISTEN state).  When the processed PKTIDX is greater than or equal
// to PKTSTOP the state transitions to LISTEN and STTVALID is set to 0.
//
// The PKTSTART/PKTSTOP tests are done every time the work blocks are advanced.
//
// The downstream thread (i.e. hpguppi_rawdisk_thread) is expected to use a
// combination of PKTIDX, PKTSTART, PKTSTOP, and (optionally) STTVALID to
// determine whether the blocks should be discarded or processed (e.g. written
// to disk).

enum run_states {IDLE, ARMED, RECORD};
enum pkt_obs_code { PKT_OBS_OK=0,
                    PKT_OBS_IDX,
                    PKT_OBS_FENG,
                    PKT_OBS_SCHAN,
                    PKT_OBS_STREAM
                  };
enum obs_info_validity { 
                OBS_UNKNOWN=-5,       //=-5
                OBS_INVALID_FENG=-4,  //=-4
                OBS_INVALID_SCHAN=-3, //=-3
                OBS_INVALID_STREAM=-2,//=-2
                OBS_INVALID=-1,       //=-1
                OBS_SEEMS_VALID=0,    //=0   sign bit for validity
                OBS_VALID=1           //=1
              };

/* Structs/functions to more easily deal with multiple
 * active blocks being filled
 */
struct datablock_stats {
    struct hpguppi_input_databuf *dbout; // Pointer to overall shared mem databuf
    int block_idx;                    // Block index number in databuf
    int64_t block_num;                // Absolute block number
    uint64_t packet_idx;              // Index of first packet number in block
    int pktidx_per_block;            // Total number of packets to go in the block
    uint64_t pkts_per_block;
    int npacket;                      // Number of packets filled so far
    int ndrop;                     // Number of dropped packets so far
    uint64_t last_pkt;                // Last packet seq number written to block
};

// ATA SNAP packet with link layer header and internal padding to optimize
// alignment.  The alignment is acheived through judicious use of IB Verbs
// scatter/gather capabilities (specifically the scatter part).
struct __attribute__ ((__packed__)) ata_snap_ibv_pkt {
  struct ethhdr ethhdr; //0
  struct iphdr iphdr;   //14
  struct udphdr udphdr; //34
  uint8_t pad0[22];     //42
  uint8_t version;      //64
  uint8_t type;         //65
  uint16_t n_chans;     //66
  uint16_t chan;        //68
  uint16_t feng_id;     //70
  uint64_t timestamp;   //72
  uint8_t pad1[48];     //80
	uint8_t payload[];    //128
};

struct __attribute__ ((__packed__)) ata_snap_pkt {
  struct ethhdr ethhdr; // headers aren't functional  // 14 bytes
  struct iphdr iphdr; // headers aren't functional    // 20 bytes
  struct udphdr udphdr; // headers aren't functional  // 8 bytes
  uint8_t pad0[66]; // Dont know the reason, but actual network payload is offset
  uint8_t version;
  uint8_t type;
  uint16_t n_chans;
  uint16_t chan;
  uint16_t feng_id;
  uint64_t timestamp;
  uint8_t payload[];//complex4 data[n_chans, 16, 2] // 4-bit real + 4-bit imaginary
};

#define ATA_SNAP_PKT_NUMBER(ata_snap_pkt)   (uint64_t)__bswap_64(ata_snap_pkt->timestamp)
#define ATA_SNAP_PKT_CHAN(ata_snap_pkt)     __bswap_16(ata_snap_pkt->chan)
#define ATA_SNAP_PKT_FENG_ID(ata_snap_pkt)  __bswap_16(ata_snap_pkt->feng_id)

// ATA SNAP header byte offset within (unpadded) packet
#define ATA_SNAP_PKT_OFFSET_HEADER \
  (sizeof(struct ethhdr) + \
   sizeof(struct iphdr ) + \
   sizeof(struct udphdr))

